// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

Console.WriteLine("Введите число");
int Num= int.Parse(Console.ReadLine());

if (Num>=0)
{
    Console.WriteLine(Num +" положительное");
}
else
Console.WriteLine(Num +" отрицательное");